-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Aug 23, 2025 at 03:29 PM
-- Server version: 10.4.28-MariaDB
-- PHP Version: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `sroiv4`
--

-- --------------------------------------------------------

--
-- Table structure for table `activities`
--

CREATE TABLE `activities` (
  `activity_id` int(11) NOT NULL,
  `strategy_id` int(11) NOT NULL,
  `activity_code` varchar(20) NOT NULL,
  `activity_name` varchar(500) NOT NULL,
  `activity_description` text DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `activities`
--

INSERT INTO `activities` (`activity_id`, `strategy_id`, `activity_code`, `activity_name`, `activity_description`) VALUES
(1, 1, '1', 'พัฒนาความรู้/ทักษะ/ศักยภาพ/ทักษะอาชีพ', NULL),
(2, 1, '2', 'ออกแบบ/พัฒนา/เพิ่มมูลค่าผลิตภัณฑ์', NULL),
(3, 1, '2.1', 'แปรรูปผลิตภัณฑ์/พัฒนาผลิตภัณฑ์ใหม่/ผลิตภัณฑ์สร้างสรรค์ (พัฒนาบรรจุภัณฑ์ โลโก้แบรนด์)', NULL),
(4, 1, '2.2', 'พัฒนามาตรฐานผลิตภัณฑ์', NULL),
(5, 1, '2.3', 'ผลิตภัณฑ์ได้รับการจดทะเบียนทรัพย์สินทางปัญญา', NULL),
(6, 1, '3', 'พัฒนาศักยภาพการท่องเที่ยว', NULL),
(7, 1, '3.1', 'พัฒนาที่พัก (โฮมสเตย์)', NULL),
(8, 1, '3.2', 'พัฒนากิจกรรมการท่องเที่ยว', NULL),
(9, 1, '3.3', 'พัฒนาเส้นทางการท่องเที่ยว/แผนที่ท่องเที่ยว', NULL),
(10, 1, '4', 'จัดทำ/พัฒนาหลักสูตร/โปรแกรมสำเร็จรูปต่างๆ', NULL),
(11, 1, '5', 'พัฒนาตลาดและช่องทางการจัดจำหน่าย', NULL),
(12, 1, '6', 'สร้างหรือพัฒนาแหล่งเรียนรู้หรือศูนย์เรียนรู้', NULL),
(13, 1, '7', 'จัดตั้งกลุ่มวิสาหกิจชุมชน', NULL),
(14, 1, '8', 'พัฒนา/สร้างทุน/กระบวนการผลิต', NULL),
(15, 1, '9', 'พัฒนาหรือสร้างนวัตกรรม', NULL),
(16, 1, '10', 'สร้างและพัฒนาเครือข่าย', NULL),
(17, 1, '11', 'พัฒนาสังคม คุณภาพชีวิต และสิ่งแวดล้อม', NULL),
(18, 1, '11.1', 'อบรม/กิจกรรมเกี่ยวกับความสุข', NULL),
(19, 1, '11.2', 'อบรม/กิจกรรมเกี่ยวกับความรัก ความสามัคคีในชุมชน', NULL),
(20, 1, '11.3', 'อบรม/กิจกรรมเกี่ยวกับคุณธรรมจริยธรรม', NULL),
(21, 1, '11.4', 'พัฒนาสุขภาพ', NULL),
(22, 1, '11.5', 'พัฒนาสิ่งแวดล้อม', NULL),
(23, 2, '1', 'จัดอบรม/พัฒนาครูและบุคลากรทางการศึกษา', 'การจัดอบรมเพื่อพัฒนาศักยภาพครูและบุคลากรทางการศึกษา'),
(24, 2, '2', 'สร้าง/พัฒนานวัตกรรมชุดการเรียนการสอน หรือ นวัตกรรมการจัดการเรียนรู้เพื่อพัฒนาผู้เรียน (เช่น สื่อการเรียนการสอนในรูปเเบบต่างๆ)', 'การสร้างและพัฒนานวัตกรรมสำหรับการเรียนการสอน รวมถึงสื่อการเรียนรู้ในรูปแบบต่างๆ เพื่อพัฒนานักเรียน'),
(27, 2, '3', 'จัดทำหลักสูตรการเรียนรู้แบบบูรณาการ/พัฒนาหลักสูตร', 'การจัดทำและพัฒนาหลักสูตรการเรียนรู้แบบบูรณาการ รวมถึงหลักสูตรอบรมด้านต่างๆ เพื่อพัฒนาครูและนักเรียน'),
(30, 2, '4', 'พัฒนานักศึกษาครู/เตรียมความพร้อมก่อนออกฝึก (ประมวลความรู้ ปฐมนิเทศ ทดสอบความรู้)', 'การพัฒนาศักยภาพและเตรียมความพร้อมให้กับนักศึกษาครูก่อนออกไปปฏิบัติการสอนจริง'),
(32, 2, '5', 'สร้างและพัฒนาเครือข่าย', 'การสร้างและพัฒนาเครือข่ายความร่วมมือในด้านการผลิตและพัฒนาครู ทั้งในระดับท้องถิ่น ระดับชาติ และระดับนานาชาติ'),
(33, 3, '1', 'สหกิจศึกษา', 'กิจกรรมสหกิจศึกษาเพื่อพัฒนาศักยภาพนักศึกษาและเชื่อมโยงกับภาคอุตสาหกรรม'),
(34, 3, '1.1', 'อบรมเชิงปฏิบัติการเตรียมความพร้อมการฝึกงานแบบบูรณาการกับการทำงาน', 'การอบรมเพื่อเตรียมความพร้อมของนักศึกษาก่อนออกฝึกงาน รวมถึงทักษะการทำงานและการปรับตัว'),
(35, 3, '1.2', 'การประกวดงานวิจัยและนวัตกรรมสหกิจศึกษา', 'การจัดประกวดเพื่อส่งเสริมการสร้างสรรค์ผลงานวิจัยและนวัตกรรมจากประสบการณ์สหกิจศึกษา'),
(36, 3, '1.3', 'การจัดทำ MOU ร่วมกับหน่วยงานที่ภาครัฐและเอกชน', 'การสร้างเครือข่ายความร่วมมือกับองค์กรต่างๆ เพื่อรองรับนักศึกษาสหกิจศึกษา'),
(37, 3, '2', 'การพัฒนาศักยภาพอาจารย์นิเทศให้เป็นไปตามเกณฑ์มาตรฐานของ สกอ.', 'การพัฒนาและยกระดับความรู้ ทักษะ และสมรรถนะของอาจารย์นิเทศให้เป็นไปตามมาตรฐานของสำนักงานคณะกรรมการการอุดมศึกษา (สกอ.)'),
(38, 3, '3', 'พัฒนาทักษะด้านภาษาอังกฤษ (CEFR)', 'การพัฒนาและยกระดับทักษะด้านภาษาอังกฤษของนักศึกษาและบุคลากรตามกรอบมาตรฐาน Common European Framework of Reference for Languages (CEFR)'),
(39, 3, '4', 'Start Up', 'กิจกรรมส่งเสริมการสร้างธุรกิจเริ่มต้นและพัฒนาผู้ประกอบการรุ่นใหม่'),
(40, 3, '4.1', 'อบรมพัฒนาทักษะการเป็นผู้ประกอบการรุ่นใหม่', 'การอบรมเพื่อพัฒนาทักษะและความรู้ด้านการประกอบการ การบริหารธุรกิจ และการสร้างนวัตกรรมสำหรับผู้ประกอบการรุ่นใหม่'),
(41, 3, '4.2', 'บ่มเพาะนักศึกษาสู่การเป็นผู้ประกอบการรุ่นใหม่', 'การให้คำปรึกษาและสนับสนุนนักศึกษาที่มีไอเดียธุรกิจให้สามารถพัฒนาเป็นธุรกิจจริงและเป็นผู้ประกอบการรุ่นใหม่'),
(42, 3, '5', 'วิศวกรสังคม โดยอบรมเชิงปฏิบัติการ ความรู้ศาสตร์พระราชาและหลักเศรษฐกิจพอเพียง SDGs (เป้าหมายการพัฒนาที่ยั่งยืน) เครื่องมือการวิเคราะห์ชุมชน เช่น SWOT, 5W1H, การตั้งคำถาม Soft Skills เช่น การทำงานเป็นทีม การสื่อสาร การรับฟัง การเรียนรู้จากกรณีศึกษาจริง กิจกรรมสร้างแรงบันดาลใจ (Motivation Camp) Workshop การเขียนโครงการเพื่อพัฒนาชุมชน', 'กิจกรรมอบรมเชิงปฏิบัติการเพื่อพัฒนาวิศวกรสังคมที่มีความรู้และทักษะในการทำงานเพื่อสังคม ครอบคลุมศาสตร์พระราชา เศรษฐกิจพอเพียง SDGs เครื่องมือวิเคราะห์ชุมชน ทักษะการทำงานร่วมกัน และการพัฒนาโครงการชุมชน'),
(43, 4, '1', 'ประชุมเตรียมความพร้อมในการบริหารจัดการ', 'การจัดประชุมเพื่อเตรียมความพร้อมและวางแผนในการบริหารจัดการองค์กรให้มีประสิทธิภาพและตอบสนองต่อการเปลี่ยนแปลง'),
(44, 4, '2', 'พัฒนา/ปรับปรุงระบบนิเวศ เพิ่มประสิทธิภาพในการจัดการเรียนการสอนและการบริหารจัดการมหาวิทยาลัย สนับสนุนและพัฒนาระบบสาธารณูปโภคขั้นพื้นฐานเพื่อบริหารจัดการมหาวิทยาลัยสู่ความเป็นเลิศ', 'การพัฒนาและปรับปรุงระบบนิเวศของมหาวิทยาลัยเพื่อเพิ่มประสิทธิภาพในการจัดการเรียนการสอนและการบริหารจัดการ พร้อมทั้งสนับสนุนและพัฒนาระบบสาธารณูปโภคขั้นพื้นฐานเพื่อมุ่งสู่ความเป็นเลิศ'),
(45, 4, '3', 'บริหารจัดการสู่การเป็น\"มหาวิทยาลัยสีเขียว\"', 'การบริหารจัดการและพัฒนามหาวิทยาลัยให้เป็นมหาวิทยาลัยสีเขียว (Green University) ที่เป็นมิตรต่อสิ่งแวดล้อม ใช้ทรัพยากรอย่างยั่งยืน และส่งเสริมการอนุรักษ์สิ่งแวดล้อม');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `activities`
--
ALTER TABLE `activities`
  ADD PRIMARY KEY (`activity_id`),
  ADD KEY `strategy_id` (`strategy_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `activities`
--
ALTER TABLE `activities`
  MODIFY `activity_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=46;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `activities`
--
ALTER TABLE `activities`
  ADD CONSTRAINT `activities_ibfk_1` FOREIGN KEY (`strategy_id`) REFERENCES `strategies` (`strategy_id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
