-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Aug 23, 2025 at 03:30 PM
-- Server version: 10.4.28-MariaDB
-- PHP Version: 8.2.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `sroiv4`
--

-- --------------------------------------------------------

--
-- Table structure for table `outcomes`
--

CREATE TABLE `outcomes` (
  `outcome_id` int(11) NOT NULL,
  `output_id` int(11) NOT NULL COMMENT 'รหัสผลผลิตที่เกี่ยวข้อง',
  `outcome_sequence` varchar(10) NOT NULL COMMENT 'ลำดับผลลัพธ์',
  `outcome_description` text NOT NULL COMMENT 'รายละเอียดผลลัพธ์',
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='ตารางเก็บข้อมูลผลลัพธ์ (Outcomes)';

--
-- Dumping data for table `outcomes`
--

INSERT INTO `outcomes` (`outcome_id`, `output_id`, `outcome_sequence`, `outcome_description`, `created_at`, `updated_at`) VALUES
(1, 2, '1.1.1', 'กลุ่มเป้าหมาย จำนวน..........คน สามารถถ่ายทอดความรู้ เกี่ยวกับ.......................ให้กับ..................จำนวน..........คน (กลุ่ม/ชุมชน)', '2025-08-02 03:57:42', '2025-08-02 03:57:42'),
(2, 2, '1.1.2', 'กลุ่มเป้าหมาย จำนวน..........คน สามารถนำความรู้ ด้าน.......................มา....(ใช้ประโยชน์อย่างไร)....ทำให้สร้างรายได้เพิ่มขึ้น', '2025-08-02 03:57:42', '2025-08-02 03:57:42'),
(3, 2, '1.1.3', 'กลุ่มเป้าหมาย จำนวน..........คน สามารถนำความรู้ ด้าน.......................มา....(ใช้ประโยชน์อย่างไร)....ทำให้ต้นทุนลดลง', '2025-08-02 03:57:42', '2025-08-02 03:57:42'),
(4, 3, '1.2.1', 'กลุ่มเป้าหมาย จำนวน..........คน สามารถถ่ายทอดความรู้ความสามารถที่เกิดจากศักยภาพ ด้าน.......................ให้กับ..................จำนวน..........คน (กลุ่ม/ชุมชน)', '2025-08-02 04:04:42', '2025-08-02 04:04:42'),
(5, 3, '1.2.2', 'กลุ่มเป้าหมาย จำนวน..........คน สามารถนำความรู้ความสามารถที่เกิดจากศักยภาพ ด้าน.......................มา....(ใช้ประโยชน์อย่างไร)....ทำให้สร้างรายได้เพิ่มขึ้น', '2025-08-02 04:04:42', '2025-08-02 04:04:42'),
(6, 3, '1.2.3', 'กลุ่มเป้าหมาย จำนวน..........คน ความรู้ความสามารถที่เกิดจากศักยภาพ ด้าน.......................มา....(ใช้ประโยชน์อย่างไร)....ทำให้ต้นทุนลดลง', '2025-08-02 04:04:42', '2025-08-02 04:04:42'),
(7, 4, '1.3.1', 'กลุ่มเป้าหมาย จำนวน..........คน สามารถถ่ายทอดสมรรถนะ ด้าน.......................ให้กับ..................จำนวน..........คน (กลุ่ม/ชุมชน)', '2025-08-02 04:06:41', '2025-08-02 04:06:41'),
(8, 4, '1.3.2', 'กลุ่มเป้าหมาย จำนวน..........คน สามารถนำสมรรถนะ ด้าน.......................มา....(ใช้ประโยชน์อย่างไร)....ทำให้สร้างรายได้เพิ่มขึ้น', '2025-08-02 04:06:41', '2025-08-02 04:06:41'),
(9, 4, '1.3.3', 'กลุ่มเป้าหมาย จำนวน..........คน สามารถนำสรรถนะ ด้าน.......................มา....(ใช้ประโยชน์อย่างไร)....ทำให้ต้นทุนลดลง', '2025-08-02 04:06:41', '2025-08-02 04:06:41'),
(10, 5, '2.1', 'กลุ่มเป้าหมายมีกลุ่มอาชีพ....(อาชีพอะไร).......ทำให้มีรายได้เพิ่มขึ้น', '2025-08-02 04:14:45', '2025-08-02 04:14:45'),
(11, 6, '1.1', 'รายได้เพิ่มขึ้นจาการขายผลิตภัณฑ์ใหม่ที่มีการพัฒนาบรรจุภัณฑ์ใหม่/โลโก้แบรนด์ใหม่ ได้แก่..........................................', '2025-08-02 04:21:09', '2025-08-02 04:21:09'),
(12, 7, '2.1', 'รายได้เพิ่มขึ้นจาการขายผลิตภัณฑ์แปรรูป (รวมถึงมีการพัฒนาบรรจุภัณฑ์ โลโก้แบรนด์ และอื่นๆ ที่เป็นการเพิ่มมูลค่าผลิตภัณฑ์แปรรูป) ได้แก่...........................................  ', '2025-08-02 04:22:51', '2025-08-02 04:22:51'),
(13, 8, '3.1', 'รายได้เพิ่มขึ้นจากการขายผลิตภัณฑ์สร้างสรรค์ (รวมถึงมีการพัฒนาบรรจุภัณฑ์ โลโก้แบรนด์ และอื่นๆ ที่เป็นการเพิ่มมูลค่าผลิตภัณฑ์แปรรูป) ได้แก่...........................................   ', '2025-08-02 04:24:19', '2025-08-02 04:24:19'),
(14, 9, '1.1', 'รายได้เพิ่มขึ้นจากการขายผลิตภัณฑ์ใหม่ที่ได้รับมาตรฐาน ได้แก่...........................................  ', '2025-08-02 07:13:42', '2025-08-02 07:13:42'),
(15, 10, '2.1', 'รายได้เพิ่มขึ้นจากการขายผลิตภัณฑ์แปรรูปที่ได้รับมาตรฐาน ได้แก่...........................................   ', '2025-08-02 07:15:20', '2025-08-02 07:15:20'),
(16, 11, '3.1', 'รายได้เพิ่มขึ้นจากการขายผลิตภัณฑ์สร้างสรรค์ที่ได้ได้รับมาตรฐาน ได้แก่...........................................    ', '2025-08-02 07:16:24', '2025-08-02 07:16:24'),
(17, 12, '1.1', 'รายได้เพิ่มขึ้นจากการขายผลิตภัณฑ์ใหม่ผลิตภัณฑ์ใหม่ได้การจดทะเบียนทรัพย์สินทางปัญญา ประเภท ลิขสิทธิ์, สิทธิบัตร, อนุสิทธิบัตร) ได้แก่...........................................     ', '2025-08-02 07:22:34', '2025-08-02 07:22:34'),
(18, 13, '2.1', 'รายได้เพิ่มขึ้นจากการขายผลิตภัณฑ์แปรรูปผลิตภัณฑ์ใหม่ได้การจดทะเบียนทรัพย์สินทางปัญญา ประเภท ลิขสิทธิ์, สิทธิบัตร, อนุสิทธิบัตร) ได้แก่...........................................     ', '2025-08-02 07:23:32', '2025-08-02 07:23:32'),
(19, 14, '3.1', 'รายได้เพิ่มขึ้นจากการขายผลิตภัณฑ์ใหม่ผลิตภัณฑ์ใหม่ได้การจดทะเบียนทรัพย์สินทางปัญญา ประเภท ลิขสิทธิ์, สิทธิบัตร, อนุสิทธิบัตร) ได้แก่...........................................     ', '2025-08-02 07:25:02', '2025-08-02 07:25:02'),
(20, 15, '1.1', 'ผู้ประกอบการที่พัก (โฮมสเตย์) เป้าหมาย จำนวน.......ราย มีรายได้เพิ่มขึ้น จากการพัฒนา.....(อย่างไร)..........', '2025-08-02 07:32:34', '2025-08-02 07:32:34'),
(21, 16, '2.1', 'ผู้ประกอบการที่พัก (โฮมสเตย์) เป้าหมาย จำนวน.......ราย มีรายได้เพิ่มขึ้น จากการได้รับมาตรฐาน...................', '2025-08-02 07:33:42', '2025-08-02 07:33:42'),
(22, 17, '1.1', 'รายได้เพิ่มขึ้นจากกิจกรรมการท่องเที่ยว 1. มีกิจกรรมการท่องเที่ยวใหม่ (กิจกรรมการท่องเที่ยวที่ได้รับการพัฒนา) (ระบุรายการกิจกรรมการท่องเที่ยวมีอะไรบ้าง)', '2025-08-02 07:36:15', '2025-08-02 07:36:15'),
(23, 18, '1.1', 'รายได้เพิ่มขึ้นจากการนำเที่ยวเส้นทางนำเที่ยวใหม่ (เส้นทางการท่องเที่ยวที่ได้รับการพัฒนา) จำนวน...........เส้นทาง', '2025-08-02 07:37:46', '2025-08-02 07:37:46'),
(24, 19, '1.1', 'กลุ่มเป้าหมายจำนวน........คน สามารถใช้ประโยชน์จากหลักสูตรในการจัดอบรมพัฒนาทักษะและทำให้เกิดรายได้จากค่าตอบแทนในการจัดอบรมหลักสูตร', '2025-08-02 07:51:48', '2025-08-02 07:51:48'),
(25, 19, '1.2', 'ผู้ใช้ประโยชน์ จำนวน.......คน ได้นำความรู้และทักษะที่ได้รับจากหลักสูตรไป...........(ประกอบอาชีพ/พัฒนาอาชีพ/พัฒนากิจการ/มีความรู้หรือทักษะที่เพิ่มขึ้น) ทำให้มีรายได้เพิ่มขึ้น จาก........(อย่างไร)..........', '2025-08-02 07:51:48', '2025-08-02 07:51:48'),
(26, 19, '1.3', 'ผู้ใช้ประโยชน์ จำนวน.......คน ได้นำความรู้และทักษะที่ได้รับจากหลักสูตรไป...........(ประกอบอาชีพ/พัฒนาอาชีพ/พัฒนากิจการ/มีความรู้หรือทักษะที่เพิ่มขึ้น) ทำให้มีค่าใช้จ่ายหรือต้นทุนลดลงจาก........(อย่างไร)..........', '2025-08-02 07:51:48', '2025-08-02 07:51:48'),
(27, 20, '2.1', 'กลุ่มเป้าหมายจำนวน........คน สามารถใช้ประโยชน์จากหลักสูตรในการจัดอบรมพัฒนาทักษะและทำให้เกิดรายได้จากค่าตอบแทนในการจัดอบรมหลักสูตร', '2025-08-02 07:55:52', '2025-08-02 07:55:52'),
(28, 20, '2.2', 'ผู้ใช้ประโยชน์ จำนวน.......คน ได้นำความรู้และทักษะที่ได้รับจากหลักสูตรไป...........(ประกอบอาชีพ/พัฒนาอาชีพ/พัฒนากิจการ/มีความรู้หรือทักษะที่เพิ่มขึ้น) ทำให้มีรายได้เพิ่มขึ้น จาก........(อย่างไร)..........', '2025-08-02 07:55:52', '2025-08-02 07:55:52'),
(29, 20, '2.3', 'ผู้ใช้ประโยชน์ จำนวน.......คน ได้นำความรู้และทักษะที่ได้รับจากหลักสูตรไป...........(ประกอบอาชีพ/พัฒนาอาชีพ/พัฒนากิจการ/มีความรู้หรือทักษะที่เพิ่มขึ้น) ทำให้มีค่าใช้จ่ายหรือต้นทุนลดลงจาก........(อย่างไร)..........', '2025-08-02 07:55:52', '2025-08-02 07:55:52'),
(30, 21, '3.1', 'รายได้เพิ่มขึ้นจากการนำโปรแกรมสำเร็จรูป................ไปประโยชน์จากทำให้มีรายได้เพิ่มขึ้นจาก....... (อย่างไร........)', '2025-08-02 07:58:34', '2025-08-02 07:58:34'),
(31, 21, '3.2', 'ต้นทุนหรือค่าใช้จ่ายจากการนำโปรแกรมสำเร็จรูป................ไปใช้ประโยชน์จากทำให้ต้นทุนหรือค่าใช้จ่ายลดลง จาก..... (อย่างไร......)', '2025-08-02 07:58:34', '2025-08-02 07:58:34'),
(32, 21, '3.3', 'ประสิทธิภาพเพิ่มขึ้นจากการนำโปรแกรมสำเร็จรูป................ไปใช้ประโยชน์จากทำให้ต้นทุนหรือค่าใช้จ่ายลดลง จาก.. (อย่างไร.......)', '2025-08-02 07:58:34', '2025-08-02 07:58:34'),
(33, 22, '4.1', 'รายได้เพิ่มขึ้นจากการนำ Application................ไปประโยชน์จากทำให้มีรายได้เพิ่มขึ้นจาก....... (อย่างไร........)', '2025-08-02 08:06:22', '2025-08-02 08:06:22'),
(34, 22, '4.2', 'ต้นทุนหรือค่าใช้จ่ายจากการนำApplication................ไปใช้ประโยชน์จากทำให้ต้นทุนหรือค่าใช้จ่ายลดลง จาก..... (อย่างไร......)', '2025-08-02 08:06:22', '2025-08-02 08:06:22'),
(35, 22, '4.3', 'ประสิทธิภาพเพิ่มขึ้นจากการนำApplication................ไปใช้ประโยชน์จากทำให้ต้นทุนหรือค่าใช้จ่ายลดลง จาก.. (อย่างไร.......)', '2025-08-02 08:06:22', '2025-08-02 08:06:22'),
(36, 23, '1.1', 'กลุ่มเป้าหมาย จำนวน......คน(ราย) มียอดขายเพิ่มขึ้น(รายได้)เพิ่มขึ้นจากช่องการตลาดออฟไลน์', '2025-08-02 08:10:26', '2025-08-02 08:10:26'),
(37, 23, '1.2', 'กลุ่มเป้าหมาย จำนวน......คน(ราย) สามารถทำให้ต้นทุน/ค่าใช้จ่ายเกี่ยวกับ..เรื่องอะไร....ลดลงจากการมีช่องการตลาดออฟไลน์ใหม่', '2025-08-02 08:10:26', '2025-08-02 08:10:26'),
(39, 24, '2.1', 'กลุ่มเป้าหมาย จำนวน......คน(ราย) มียอดขายเพิ่มขึ้น(รายได้)เพิ่มขึ้นจากช่องการตลาดออนไลน์', '2025-08-02 08:12:22', '2025-08-02 08:12:22'),
(40, 25, '3.1', 'กลุ่มเป้าหมาย จำนวน......คน(ราย) มียอดขาย(รายได้)เพิ่มขึ้นการจัดงานแสดงผลิตภัณฑ์/ผลงาน', '2025-08-02 08:15:34', '2025-08-02 08:15:34'),
(41, 26, '4.1', 'กลุ่มเป้าหมาย จำนวน......คน(ราย) ยอดขาย(มีรายได้)เพิ่มขึ้นจากสื่อด้านการตลาด (สื่อออนไลน์.....สื่ออะไร.......)', '2025-08-02 08:17:10', '2025-08-02 08:17:10'),
(42, 27, '5.1', 'กลุ่มเป้าหมาย จำนวน......คน(ราย) ยอดขาย(มีรายได้)เพิ่มขึ้นจากสื่อด้านการตลาด (สื่อ ออฟไลน์).....สื่ออะไร.......', '2025-08-02 08:18:55', '2025-08-02 08:18:55'),
(43, 28, '1.1', 'กลุ่ม/ชุมชนเป้าหมายได้เผยแพร่ภูมิปัญญาเกี่ยวกับ.......ทำให้มียอดขายสินค้า/ผลิตภัณฑ์เพิ่มขึ้น', '2025-08-02 08:23:35', '2025-08-02 08:23:35'),
(44, 28, '1.2', 'มีจำนวนผู้เข้าเยี่ยมชมเพิ่มขึ้นกลุ่ม/ชุมชนได้เผยแพร่ภูมิปัญญาเกี่ยวกับ.......ทำให้กลุ่ม/ชุมชนมีรายได้เพิ่มขึ้น', '2025-08-02 08:23:35', '2025-08-02 08:23:35'),
(46, 29, '1.1', 'รายได้เพิ่มขึ้น จาก........อะไร............จากการจัดตั้งกลุ่มวิสาหกิจ', '2025-08-02 08:27:50', '2025-08-02 08:27:50'),
(47, 29, '1.2', 'ต้นทุนลดลง จาก........อะไร............ จากการจัดตั้งกลุ่มวิสาหกิจ', '2025-08-02 08:27:50', '2025-08-02 08:27:50'),
(49, 30, '1.1', 'เมื่อมี....(ระบบ อุปกรณ์ เครื่องจักร เครื่องใช้ เทคโนโลยี โรงเรือน สถานที่).....ทำให้มีผลผลิตเพิ่มขึ้น', '2025-08-02 08:46:17', '2025-08-02 08:46:17'),
(50, 30, '1.2', 'เมื่อมี....(ระบบ อุปกรณ์ เครื่องจักร เครื่องใช้ เทคโนโลยี โรงเรือน สถานที่).....ทำให้ลดต้นทุนเกี่ยวกับ....................', '2025-08-02 08:46:17', '2025-08-02 08:46:17'),
(51, 30, '1.3', 'เมื่อมี....(ระบบ อุปกรณ์ เครื่องจักร เครื่องใช้ เทคโนโลยี โรงเรือน สถานที่).....ทำให้มีรายได้เพิ่มขึ้น', '2025-08-02 08:46:17', '2025-08-02 08:46:17'),
(52, 30, '1.4', 'เมื่อมี....(ระบบ อุปกรณ์ เครื่องจักร เครื่องใช้ เทคโนโลยี โรงเรือน สถานที่).....ทำให้ประสิทธิภาพด้าน...........เพิ่มขึ้น (เช่น เวลาลดลง ใช้แรงงานลดลง ฯลฯ)', '2025-08-02 08:46:17', '2025-08-02 08:46:17'),
(56, 32, '1.1', 'กลุ่มเป้าหมาย จำนวน.........คน รายได้เพิ่มขึ้นจากการนำนวัตกรรมการใช้ประโยชน์ทำให้......(อะไรดีขึ้นอย่างไร).............', '2025-08-02 08:53:40', '2025-08-02 08:53:40'),
(57, 32, '1.2', 'กลุ่มเป้าหมาย จำนวน..........คน ต้นทุนลดลงจากการนำนวัตกรรมการใช้ประโยชน์ทำให้......(อะไรดีขึ้นอย่างไร).............', '2025-08-02 08:53:40', '2025-08-02 08:53:40'),
(58, 32, '1.3', 'มีประสิทธิภาพ...(เช่น ด้านผลผลิต เวลาทำงาน)...เพิ่มขึ้น จากการนำนวัตกรรมการใช้ประโยชน์ทำให้......(อะไรดีขึ้นอย่างไร).............', '2025-08-02 08:53:40', '2025-08-02 08:53:40'),
(59, 33, '2.1', 'นวัตกรรมมีชื่อเสียงและได้รับความน่าเชื่อถือทำให้มีรายได้เพิ่มขึ้นจาก....(ใช้ประโยชน์จากนวัตกรรมอย่างไร).....', '2025-08-02 08:55:14', '2025-08-02 08:55:14'),
(60, 34, '3.1', 'รายได้เพิ่มขึ้นจากการขอใช้สิทธิ์นวัตกรรม', '2025-08-02 08:56:11', '2025-08-02 08:56:11'),
(61, 35, '1.1', 'กลุ่มเป้าหมาย จำนวน..........คน มีรายได้เพิ่มขึ้นจาก...มีอะไรดีขึ้น......จากการมีเครือข่าย...ชื่อเครือข่าย......', '2025-08-02 08:59:24', '2025-08-02 08:59:24'),
(62, 35, '1.2', 'กลุ่มเป้าหมาย จำนวน..........คนมีต้นทุนลดลงนจาก...มีอะไรดีขึ้น......จากการมีเครือข่าย...ชื่อเครือข่าย......', '2025-08-02 08:59:24', '2025-08-02 08:59:24'),
(64, 36, '2.1', 'กลุ่มเป้าหมาย จำนวน..........คน มีรายได้เพิ่มขึ้นจาก...มีอะไรดีขึ้น......จากการมี MOU กับ...ชื่อหน่วยงานที่ทำ MOU......', '2025-08-02 09:01:21', '2025-08-02 09:01:21'),
(65, 36, '2.2', 'กลุ่มเป้าหมาย จำนวน..........คนมีต้นทุนลดลงนจาก...มีอะไรดีขึ้น......จากการมี MOU กับ...ชื่อหน่วยงานที่ทำ MOU......', '2025-08-02 09:01:21', '2025-08-02 09:01:21'),
(67, 37, '3.1', 'กลุ่มเป้าหมาย จำนวน..........คน มีรายได้เพิ่มขึ้นจาก...มีอะไรดีขึ้น......จากการจากการจับคู่ทางการค้า', '2025-08-02 09:02:31', '2025-08-02 09:02:31'),
(68, 37, '3.2', 'กลุ่มเป้าหมาย จำนวน..........คนมีต้นทุนลดลงนจาก...มีอะไรดีขึ้น......จากการจากการจับคู่ทางการค้า', '2025-08-02 09:02:31', '2025-08-02 09:02:31'),
(70, 31, '2.1', 'เมื่อมี....(ระบบ อุปกรณ์ เครื่องจักร เครื่องใช้ เทคโนโลยี โรงเรือน สถานที่).....ทำให้มีผลผลิตเพิ่มขึ้น', '2025-08-02 14:11:28', '2025-08-02 14:11:28'),
(71, 31, '2.2', 'เมื่อมี....(ระบบ อุปกรณ์ เครื่องจักร เครื่องใช้ เทคโนโลยี โรงเรือน สถานที่).....ทำให้ลดต้นทุนเกี่ยวกับ....................', '2025-08-02 14:11:28', '2025-08-02 14:11:28'),
(72, 31, '2.3', 'เมื่อมี....(ระบบ อุปกรณ์ เครื่องจักร เครื่องใช้ เทคโนโลยี โรงเรือน สถานที่).....ทำให้มีรายได้เพิ่มขึ้น', '2025-08-02 14:11:28', '2025-08-02 14:11:28'),
(73, 31, '2.4', 'เมื่อมี....(ระบบ อุปกรณ์ เครื่องจักร เครื่องใช้ เทคโนโลยี โรงเรือน สถานที่).....ทำให้ประสิทธิภาพด้าน...........เพิ่มขึ้น (เช่น เวลาลดลง ใช้แรงงานลดลง ฯลฯ)', '2025-08-02 14:11:28', '2025-08-02 14:11:28'),
(77, 38, '1.1', 'กลุ่มเป้าหมายมีความรู้/เข้าใจเกี่ยวกับความสุขเพิ่มขึ้น และนำมาปรับใช้ทำให้มีความสุขเพิ่มขึ้นจาก....(อะไรเปลี่ยนแปลงดีขึ้น เช่น มีพฤติกรรมบางอย่างด้านลบน้อยลง)......', '2025-08-02 14:32:36', '2025-08-02 14:32:36'),
(78, 39, '1.1', 'กลุ่มเป้าหมายมีความรู้/เข้าใจเกี่ยวกับการสร้างความรักความสามัคคีเพิ่มขึ้น และนำมาปรับใช้ทำให้มีความรักความสามัคคีจาก....(อะไรเปลี่ยนแปลงดีขึ้น เช่น มีพฤติกรรมบางอย่างด้านลบน้อยลง)......', '2025-08-02 14:34:25', '2025-08-02 14:34:25'),
(79, 40, '1.1', 'กลุ่มเป้าหมายมีคุณธรรมจริยธรรมมากขึ้นส่งผลทำให้มีพฤติกรรม..... (เปลี่ยนไปในทางที่ดีขึ้นอย่างไร).....', '2025-08-02 14:35:12', '2025-08-02 14:35:12'),
(80, 41, '1.1', 'กลุ่มเป้าหมายจำนวน......คน สุขภาพเกี่ยวกับ...(สุขภาพด้านใด).......ดีขึ้น ทำให้ค่าใช้จ่ายด้านการักษาสุขภาพลดลง', '2025-08-02 14:36:01', '2025-08-02 14:36:01'),
(81, 41, '1.1', 'กลุ่มเป้าหมายจำนวน......คน มีพฤติกรรมด้านสุขภาพดีขึ้น ทำให้ค่าใช้จ่ายด้านการักษาสุขภาพลดลง', '2025-08-02 14:42:02', '2025-08-02 14:42:02'),
(82, 41, '1.2', 'กลุ่มเป้าหมายจำนวน......คน มีพฤติกรรมด้านสุขภาพดีขึ้น ทำให้ค่าใช้จ่ายด้านการป้องกันสุขภาพลดลง', '2025-08-02 14:42:02', '2025-08-02 14:42:02'),
(84, 42, '1.1', 'กลุ่มเป้าหมายจำนวน......คน ได้รับการพัฒนาสภาพแวดล้อมดีขึ้น จาก....กิจกรรมอะไร เช่น การคัดแยกขยะ การมีอุปกรณ์นวัตกรรมในการเก็บขยะ กิจกรรมการผลิตที่ลดมลพิษ เช่น ควัน การลดการใช้ปุ๋ยเคมี....', '2025-08-02 14:45:56', '2025-08-02 14:45:56'),
(85, 43, '1.1', 'ครู/บุคลากรทางการศึกษา จำนวน.......คน มีความรู้/ทักษะเรื่อง.............................................เพิ่มขึ้นและสามารถทำให้เลื่อนตำแหน่ง/วิทยฐานะที่สูงขึ้น', '2025-08-23 08:22:15', '2025-08-23 08:22:15'),
(86, 43, '1.2', 'ครู/บุคลากรทางการศึกษา จำนวน.......คน มีความรู้/ทักษะเรื่อง..................... เพิ่มขึ้นและสามารถทำให้ถ่ายทอดได้', '2025-08-23 08:24:13', '2025-08-23 08:24:13'),
(87, 44, '2.1', 'ครูจำนวน......คน สามารถลดเวลาในเตรียมบทเรียนได้', '2025-08-23 08:25:34', '2025-08-23 08:25:34'),
(88, 44, '2.2', 'ครูจำนวน......คน มีเวลาว่างเพื่อไปทำประโยชน์อื่นๆ เพิ่มขึ้น', '2025-08-23 08:27:08', '2025-08-23 08:27:08'),
(89, 44, '2.3', 'ครูจำนวน.....คน สามารถนำไปประยุกต์ใช้ในการจัดการเรียนการสอนได้จริง ทำให้นักเรียนมีผลสัมฤทธิ์ทางการเรียนด้าน…......เพิ่มขึ้น', '2025-08-23 08:31:57', '2025-08-23 08:31:57'),
(90, 45, '3.1', 'ครูจำนวน......คน สามารถลดเวลาในเตรียมบทเรียนได้', '2025-08-23 08:34:01', '2025-08-23 08:34:01'),
(91, 45, '3.2', 'ครูจำนวน......คน มีเวลาว่างเพื่อไปทำประโยชน์อื่นๆ เพิ่มขึ้น', '2025-08-23 08:35:16', '2025-08-23 08:35:16'),
(92, 45, '3.3', 'ครูจำนวน.....คน สามารถนำไปประยุกต์ใช้ในการจัดการเรียนการสอนได้จริง ทำให้นักเรียนมีผลสัมฤทธิ์ทางการเรียนด้าน…......เพิ่มขึ้น', '2025-08-23 08:36:26', '2025-08-23 08:36:26'),
(93, 46, '4.1', 'ครูจำนวน......คน สามารถลดเวลาในเตรียมบทเรียนได้', '2025-08-23 08:38:25', '2025-08-23 08:38:25'),
(94, 46, '4.2', 'ครูจำนวน......คน มีเวลาว่างเพื่อไปทำประโยชน์อื่นๆ เพิ่มขึ้น', '2025-08-23 08:39:31', '2025-08-23 08:39:31'),
(95, 46, '4.3', 'ครูจำนวน.....คน สามารถนำไปประยุกต์ใช้ในการจัดการเรียนการสอนได้จริง ทำให้นักเรียนมีผลสัมฤทธิ์ทางการเรียนด้าน…......เพิ่มขึ้น', '2025-08-23 08:40:57', '2025-08-23 08:40:57'),
(96, 47, '5.1', 'ครูจำนวน......คน สามารถลดเวลาในเตรียมบทเรียนได้', '2025-08-23 12:10:38', '2025-08-23 12:10:38'),
(97, 47, '5.2', 'ครูจำนวน......คน มีเวลาว่างเพื่อไปทำประโยชน์อื่นๆ เพิ่มขึ้น', '2025-08-23 12:12:43', '2025-08-23 12:12:43'),
(98, 47, '5.3', 'ครูจำนวน.....คน สามารถนำไปประยุกต์ใช้ในการจัดการเรียนการสอนได้จริง ทำให้นักเรียนมีผลสัมฤทธิ์ทางการเรียนด้าน…......เพิ่มขึ้น', '2025-08-23 12:13:51', '2025-08-23 12:13:51'),
(99, 48, '6.1', 'ครูจำนวน......คน สามารถลดเวลาในเตรียมบทเรียนได้', '2025-08-23 12:16:32', '2025-08-23 12:16:32'),
(100, 48, '6.2', 'ครูจำนวน......คน มีเวลาว่างเพื่อไปทำประโยชน์อื่นๆ เพิ่มขึ้น', '2025-08-23 12:17:21', '2025-08-23 12:17:21'),
(101, 48, '6.3', 'ครูจำนวน.....คน สามารถนำไปประยุกต์ใช้ในการจัดการเรียนการสอนได้จริง ทำให้นักเรียนมีผลสัมฤทธิ์ทางการเรียนด้าน…......เพิ่มขึ้น', '2025-08-23 12:18:21', '2025-08-23 12:18:21'),
(102, 49, '7.1', 'โรงเรียนเครือข่ายจำนวน..............แห่ง สามารถลดต้นทุนในการใช้/จัดหาสื่อการเรียนการสอนจากการใช้นวัตกรรมชื่อ..................................', '2025-08-23 12:21:40', '2025-08-23 12:21:40'),
(103, 49, '7.2', 'โรงเรียนเครือข่ายจำนวน................แห่ง สามารถลดงบประมาณค่าใช้จ่ายในการอบรมพัฒนาความรู้/ทักษะเกี่ยวกับ.......เมื่อใช้นวัตกรรม..................', '2025-08-23 12:22:46', '2025-08-23 12:22:46'),
(104, 49, '7.3', 'ประสิทธิภาพการเรียนการสอนเพิ่มขึ้น(ปัญหาการสอนลดลง)', '2025-08-23 12:23:43', '2025-08-23 12:23:43'),
(105, 50, '8.1', 'ครูกลุ่มเป้าหมายจำนวน.........คน นำหลักสูตรไปใช้ประโยชน์ทำให้....ทักษะ/ความรู้ด้าน......ดีขึ้น/เพิ่มขึ้น', '2025-08-23 12:26:23', '2025-08-23 12:26:23'),
(106, 50, '8.2', 'นักเรียนกลุ่มเป้าหมายจำนวน.........คน นำหลักสูตรไปใช้ประโยชน์ทำให้....ทักษะ/ความรู้ด้าน......ดีขึ้น/เพิ่มขึ้น', '2025-08-23 12:27:19', '2025-08-23 12:27:19'),
(107, 50, '8.3', 'โรงเรียนกลุ่มเป้าหมายจำนวน.......แห่ง นำหลักสูตรไปใช้ประโยชน์ทำให้.......ทำให้สามารถลดต้นทุนได้', '2025-08-23 12:28:08', '2025-08-23 12:28:08'),
(108, 51, '9.1', 'นักศึกษาครูจำนวน...........คน ผ่านการสอบประมวลความรู้ และสามารถออกฝึกได้ตามเวลา', '2025-08-23 12:30:12', '2025-08-23 12:30:12'),
(109, 51, '9.2', 'นักศึกษาครูจำนวน.....คน มีคะแนนทดสอบความรู้ด้าน.........ผ่านเกณฑ์', '2025-08-23 12:31:21', '2025-08-23 12:31:21'),
(110, 51, '9.3', 'นักศึกษาครูมีคุณภาพและความพร้อมในการออกฝึกสอน (มีความมั่นใจในการออกฝึกเพิ่มขึ้น)', '2025-08-23 12:33:52', '2025-08-23 12:33:52'),
(111, 51, '9.4', 'โรงเรียน/ครูพี่เลี้ยงลดภาระในการฝึกสอนซ้ำ', '2025-08-23 12:36:47', '2025-08-23 12:36:47'),
(112, 52, '10.1', 'นักศึกษาครู จำนวน.... คน ลดค่าใช้จ่ายในการหาที่ฝึกสอนมีที่ฝึกสอนที่ตรงความต้องการและฝึกสอนได้ครบกำหนด', '2025-08-23 12:40:38', '2025-08-23 12:40:38'),
(113, 52, '10.2', 'โรงเรียน จำนวน.......แห่ง มีบุคลากรในช่วยสอนเพิ่มขึ้น สามารถลดค่าใช้จ่ายในการจ้างครู', '2025-08-23 12:42:32', '2025-08-23 12:42:32'),
(114, 53, '11.1', 'นักศึกษาครู จำนวน.... คน ลดค่าใช้จ่ายในการหาที่ฝึกสอนมีที่ฝึกสอนที่ตรงความต้องการและฝึกสอนได้ครบกำหนด', '2025-08-23 13:13:19', '2025-08-23 13:13:19'),
(115, 53, '11.2', 'โรงเรียน จำนวน.......แห่ง มีบุคลากรในช่วยสอนเพิ่มขึ้น สามารถลดค่าใช้จ่ายในการจ้างครู', '2025-08-23 13:14:49', '2025-08-23 13:14:49');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `outcomes`
--
ALTER TABLE `outcomes`
  ADD PRIMARY KEY (`outcome_id`),
  ADD KEY `idx_output_id` (`output_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `outcomes`
--
ALTER TABLE `outcomes`
  MODIFY `outcome_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=116;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `outcomes`
--
ALTER TABLE `outcomes`
  ADD CONSTRAINT `outcomes_ibfk_1` FOREIGN KEY (`output_id`) REFERENCES `outputs` (`output_id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
